# 1- Preprocessing

## Open the file

In [2]:
import pandas as pd
import numpy as np

In [6]:
hw =pd.read_csv('hw_data.csv')
hw

,Unnamed: 0,Age,Gender,Education Level,Income,Marital Status,Employment Status,Product Category,Satisfaction Level,Debt Status
0,0,500,Female,NaN,31158.0,NaN,NaN,NaN,9,1
1,1,73,Female,College,54465.0,NaN,0.0,E,5,1
2,2,68,Male,High School,37427.0,married,0.0,D,1,1
3,3,61,Female,College,52210.0,widowed,0.0,G,8,1
4,4,34,Female,College,59325.0,separated,1.0,A,5,0
...,...,...,...,...,...,...,...,...,...,...
105,56,85,Female,University,39063.0,divorced,NaN,F,8,0
106,0,500,Female,NaN,31158.0,NaN,NaN,NaN,9,0
107,73,39,Female,College,55750.0,married,1.0,F,5,1
108,28,80,Female,High School,32142.0,separated,NaN,C,7,1
109,30,500,Female,High School,18442.0,separated,1.0,A,3,0

## Examine file

In [8]:
hw.info

<bound method DataFrame.info of      Unnamed: 0  Age  Gender Education Level   Income Marital Status  \
0             0  500  Female             NaN  31158.0            NaN
1             1   73  Female         College  54465.0            NaN
2             2   68    Male     High School  37427.0        married
3             3   61  Female         College  52210.0        widowed
4             4   34  Female         College  59325.0      separated
..          ...  ...     ...             ...      ...            ...
105          56   85  Female      University  39063.0       divorced
106           0  500  Female             NaN  31158.0            NaN
107          73   39  Female         College  55750.0        married
108          28   80  Female     High School  32142.0      separated
109          30  500  Female     High School  18442.0      separated

     Employment Status Product Category  Satisfaction Level  Debt Status
0                  NaN              NaN                   9            1
1                  0.0                E                   5            1
2                  0.0                D                   1            1
3                  0.0                G                   8            1
4                  1.0                A                   5            0
..                 ...              ...                 ...          ...
105                NaN                F                   8            0
106                NaN              NaN                   9            0
107                1.0                F                   5            1
108                NaN                C                   7            1
109                1.0                A                   3            0

[110 rows x 10 columns]>

In [7]:
hw.dtypes

Unnamed: 0              int64
Age                     int64
Gender                 object
Education Level        object
Income                float64
Marital Status         object
Employment Status     float64
Product Category       object
Satisfaction Level      int64
Debt Status             int64
dtype: object

In [10]:
hw.describe().T

,count,mean,std,min,25%,50%,75%,max
Unnamed: 0,110.0,4.939091e+01,2.879478e+01,0.0,26.25,49.5,73.75,99.0
Age,110.0,9.802727e+01,1.439335e+02,0.0,30.25,54.0,84.00,500.0
Income,98.0,5.752785e+07,1.768291e+08,6740.0,31158.00,38702.5,50333.50,863305114.0
Employment Status,75.0,5.733333e-01,4.979236e-01,0.0,0.00,1.0,1.00,1.0
Satisfaction Level,110.0,4.527273e+00,2.801406e+00,0.0,2.00,5.0,7.00,9.0
Debt Status,110.0,4.636364e-01,5.009582e-01,0.0,0.00,0.0,1.00,1.0

In [11]:
hw.describe(include=object).T

                 count unique         top freq
Gender             110      2        Male   56
Education Level     93      4  University   30
Marital Status      91      5   separated   25
Product Category    97      7           G   20

In [13]:
hw.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
Unnamed: 0,110.0,NaN,NaN,NaN,49.390909,28.79478,0.0,26.25,49.5,73.75,99.0
Age,110.0,NaN,NaN,NaN,98.027273,143.9335,0.0,30.25,54.0,84.0,500.0
Gender,110,2,Male,56,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Education Level,93,4,University,30,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Income,98.0,NaN,NaN,NaN,57527845.163265,176829092.570038,6740.0,31158.0,38702.5,50333.5,863305114.0
Marital Status,91,5,separated,25,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Employment Status,75.0,NaN,NaN,NaN,0.573333,0.497924,0.0,0.0,1.0,1.0,1.0
Product Category,97,7,G,20,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Satisfaction Level,110.0,NaN,NaN,NaN,4.527273,2.801406,0.0,2.0,5.0,7.0,9.0
Debt Status,110.0,NaN,NaN,NaN,0.463636,0.500958,0.0,0.0,0.0,1.0,1.0

## Define missing values

In [16]:
# To insert the mean value of each column into its missing rows:
hw.fillna(hw.mean(numeric_only=True).round(1), inplace=True)

# For median:
hw.fillna(hw.median(numeric_only=True).round(1), inplace=True)

print(hw)

     Unnamed: 0  Age  Gender Education Level   Income Marital Status  \
0             0  500  Female             NaN  31158.0            NaN
1             1   73  Female         College  54465.0            NaN
2             2   68    Male     High School  37427.0        married
3             3   61  Female         College  52210.0        widowed
4             4   34  Female         College  59325.0      separated
..          ...  ...     ...             ...      ...            ...
105          56   85  Female      University  39063.0       divorced
106           0  500  Female             NaN  31158.0            NaN
107          73   39  Female         College  55750.0        married
108          28   80  Female     High School  32142.0      separated
109          30  500  Female     High School  18442.0      separated

     Employment Status Product Category  Satisfaction Level  Debt Status
0                  0.6              NaN                   9            1
1                  0.0                E                   5            1
2                  0.0                D                   1            1
3                  0.0                G                   8            1
4                  1.0                A                   5            0
..                 ...              ...                 ...          ...
105                0.6                F                   8            0
106                0.6              NaN                   9            0
107                1.0                F                   5            1
108                0.6                C                   7            1
109                1.0                A                   3            0

[110 rows x 10 columns]

## Decide about missing values (fill or drop)

In [17]:
hw.fillna(method='bfill', inplace=True)

C:\Users\murat\AppData\Local\Temp\ipykernel_17896\3464202856.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  hw.fillna(method='bfill', inplace=True)

In [18]:
# Interpolate backwardly across the column:
hw.interpolate(method ='linear', limit_direction ='backward', inplace=True)

# Interpolate in forward order across the column:
hw.interpolate(method ='linear', limit_direction ='forward', inplace=True)

C:\Users\murat\AppData\Local\Temp\ipykernel_17896\55961211.py:2: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  hw.interpolate(method ='linear', limit_direction ='backward', inplace=True)
C:\Users\murat\AppData\Local\Temp\ipykernel_17896\55961211.py:5: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  hw.interpolate(method ='linear', limit_direction ='forward', inplace=True)

## Why did you fill missing values or if you have dropped, why did you do so?

## Find outliers if there are

## Decide what will you do with outliers

## Find duplicates, how many are there? Decide what will you do about that?

## Explain why did you do that?

# 2- Categorization

## Categorize satisfaction in 3 level and label them as 'Low', 'Moderate' and 'High'. Add a new column named 'Satisfaction Category' and store them there

#### ||| Low Satisfaction : (1-3) ||| Moderate Satisfaction : (4-7) ||| High Satisfaction : (8-10) |||

## Categorize income in 3 level and label them as 'Low', 'Moderate' and 'High'. Add a new column named 'Income Category' and store them there

# 3- Analyse

## Comparing using pivot tables

### Is there a relation between marital status and debt status?

### Is there a relation between income category and debt status?

### Is there a relation between education level and satisfaction category?

### Is there a relation between employment status and satisfaction category?

# 4- General Conclusion

-

---

### Checklist

- [x]  start homework;
- [ ]  file open;
- [ ]  file examined;
- [ ]  missing values defined;
- [ ]  missing values are filled;
- [ ]  explanation for the possible causes of missing values;
- [ ]  an explanation of how the blanks are filled;
- [ ]  an explanation of how the blanks are filled;
- [ ]  finding outliers;
- [ ]  handling outliers;
- [ ]  duplicates showed;
- [ ]  duplicates deleted;
- [ ]  an explanation of which method is used to find and remove duplicates;
- [ ]  data is categorized;
- [ ]  an answer to the question " Is there a relation betweenmarital status and debt status?";
- [ ]  an answer to the question " Is there a relation between income category and debt status?";
- [ ]  an answer to the question " Is there a relation between education level and satisfaction category?";
- [ ]  an answer to the question " Is there a relation between employment status and satisfaction category?"
- [ ]  conclusions are present on each stage;
- [ ]  a general conclusion is made.

---